<template>
<section class="technologies main section home-technologies">
    <GridMenu :data='array' />

</section>
</template>

<script>
import GridMenu from "@/components/grid-menu/container/grid-menu";

export default {
  name: "Technologies",
  components: {
    GridMenu
  },
  data() {
    return {
      array: [
        {
          id: "block1",
          heading: "Blockchain",
          icon: `<img width="50" height="50" src="@/assets/img/content/blockchain.png" alt="">`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },

        {
          id: "block2",
          heading: "Consensus",
          icon: `<img width="50" height="50" src="@/assets/img/content/blockchain.png" alt="">`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block3",
          heading: "Сryptographic network protocols ",
          icon: `<img width="50" height="50" src="@/assets/img/content/blockchain.png" alt="">`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block4",
          heading: "Dapp Browsers",
          icon: `<img width="50" height="50" src="@/assets/img/content/blockchain.png" alt="">`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block5",
          heading: "Data Feeds",
          icon: `<img width="50" height="50" src="@/assets/img/content/blockchain.png" alt="">`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block6",
          heading: "Decentralized applications",
          icon: `<img width="50" height="50" src="@/assets/img/content/blockchain.png" alt="">`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block7",
          heading: "Messaging",
          icon: `<img width="50" height="50" src="@/assets/img/content/blockchain.png" alt="">`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block8",
          heading: "Storage",
          icon: `<img width="50" height="50" src="@/assets/img/content/blockchain.png" alt="">`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        }
      ]
    };
  }
};
</script>

<style lang="scss">
</style>
