<template>
<section class="technologies main section home-technologies">
    <GridMenu :data='array' />

</section>
</template>

<script>
import GridMenu from "@/components/grid-menu/container/grid-menu";

export default {
  name: "Technologies",
  components: {
    GridMenu
  },
  data() {
    return {
      array: [
        {
          id: "block1",
          heading: "Blockchain",
          icon: `/static/img/1.0555861.gif`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },

        {
          id: "block2",
          heading: "Consensus",
          icon: `/static/img/2.0d2ba5f.gif`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block3",
          heading: "Сryptographic network protocols ",
          icon: `/static/img/3.1679bc5.gif`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block4",
          heading: "Dapp Browsers",
          icon: `/static/img/4.4ffbeba.gif`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block5",
          heading: "Data Feeds",
          icon: `/static/img/5.c3c92f0.gif`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block6",
          heading: "Decentralized applications",
          icon: `/static/img/6.fe51b64.gif`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block7",
          heading: "Messaging",
          icon: `/static/img/7.0192ad2.gif`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        },
        {
          id: "block8",
          heading: "Storage",
          icon: `/static/img/8.0d17e32.gif`,
          desc: `Каждый продукт ставит перед собой цели решить определенные проблемы или задачи. На рынке blockchain разработок даже разработчики не всегда понимают всех ньюансов и предлагают шаблонные решения, клиент не являясь специалистом в данной теме, верит на слово и сталкивается с проблемами, которые приводят к перевыпуску токена или переработке продукта после его запуска (успешных сборов средств на ICO-кампаниях или получения популярности среди клиентов). Продукт не выдерживает количевства транзакций, или не справляется с нагрузками. 
Что приводит к остановке деятельности 
компании и потери репутации`
        }
      ]
    };
  }
};
</script>

<style lang="scss">
</style>
